WeMakeIt1995/VEE/include/hw/misc/vee_stm32f4xx_spi.h
/*
 * VEE STM32F4XX SPI
 *
 * Copyright (c) 2025 Jiehan Guo <1003425554@qq.com>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL
 * THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#ifndef HW_VEE_STM32F4XX_SPI_H
#define HW_VEE_STM32F4XX_SPI_H

#include "hw/sysbus.h"
#include "hw/qdev-clock.h"
#include "qemu/main-loop.h"
#include "qemu/queue.h"
#include "qemu/timer.h"
#include "qom/object.h"

#include "stm32f4xx_gpio.h"

typedef enum {
    StmSpiCR1,
    StmSpiCR2,
    StmSpiSR,
    StmSpiDR,
    StmSpiCRCPR,
    StmSpiRxCRCR,
    StmSpiTxCRCR,
    StmSpiI2SCFGR,
    StmSpiI2SPR,
    StmSpiRegCount,
} StmSpiReg;

#define TYPE_VEE_STM32F4XX_SPI "vee-stm32f4xx-spi"
OBJECT_DECLARE_SIMPLE_TYPE(VEE_STM32F4XXSPIState, VEE_STM32F4XX_SPI)

typedef struct VEE_STM32F4XXSPIState {
    /* <private> */
    SysBusDevice parent_obj;

    /* <public> */
    MemoryRegion mmio;

    uint32_t    portIndex;

    uint32_t    regs[StmSpiRegCount];

    STM32F4XXAFIOState     *afio_cs, *afio_sck, *afio_miso, *afio_mosi;

    Clock      *clock;

    QEMUTimer   clockTimer;

    struct {
        int     bits_remain;

        uint32_t    tx_data, tx_buffer;
        uint32_t    rx_data;

        bool        tx_buffer_valid;
    } transmitStatus;
} VEE_STM32F4XXSPIState;

#endif
